In [2]:
#data loading and storage, formats
import pandas as pd
df=pd.read_csv('C:/Users/cleopathy/python_note/python_data_analysis/ex1.csv')
df

   a,   b,   c,   d, message
0  1,   2,   3,   4,   hello
1  5,   6,   7,   8,   world
2  9,  10,  11,  12,     foo

In [4]:
pd.read_table('C:/Users/cleopathy/python_note/python_data_analysis/ex1.csv',sep=',')

   a,   b,   c,   d, message
0  1,   2,   3,   4,   hello
1  5,   6,   7,   8,   world
2  9,  10,  11,  12,     foo

In [8]:
pd.read_csv('C:/Users/cleopathy/python_note/python_data_analysis/ex2.csv',header=None)

    0    1    2    3      4
0  1,   2,   3,   4,  hello
1  5,   6,   7,   8,  world
2  9,  10,  11,  12,    foo

In [9]:
pd.read_csv('C:/Users/cleopathy/python_note/python_data_analysis/ex2.csv',names = ['a','b','c','d','message'])

    a    b    c    d message
0  1,   2,   3,   4,   hello
1  5,   6,   7,   8,   world
2  9,  10,  11,  12,     foo

In [10]:
names = ['a','b','c','d','message']
pd.read_csv("C:/Users/cleopathy/python_note/python_data_analysis/ex2.csv",names = names, index_col ='message')

          a    b    c    d
message
hello    1,   2,   3,   4,
world    5,   6,   7,   8,
foo      9,  10,  11,  12,

In [13]:
parsed = pd.read_csv('C:/Users/cleopathy/python_note/python_data_analysis/csv_mindex.csv',index_col = ['key1','key2'])
parsed

          value1  value2
key1 key2
one, a,       1,        2
     b,       3,        4
     c,       5,        6
     d,       7,        8
two, a,       9,       10
     b,      11,       12
     c,      13,       14
     d,      15,       16

In [14]:
pd.read_csv('C:/Users/cleopathy/python_note/python_data_analysis/ex2.csv',skiprows=[0,2]
         )

Empty DataFrame
Columns: [5,, 6,, 7,, 8,, world]
Index: []

In [16]:
result = pd.read_csv('C:/Users/cleopathy/python_note/python_data_analysis/ex6.csv')
result

     one  10000  non-null  values
0    two  10000  non-null  values
1  three  10000  non-null  values
2   four  10000  non-null  values
3   fkey  10000  non-null  values

In [19]:
pd.read_csv('C:/Users/cleopathy/python_note/python_data_analysis/ex6.csv',nrows=3)

     one  10000  non-null  values
0    two  10000  non-null  values
1  three  10000  non-null  values
2   four  10000  non-null  values

In [22]:
#write data out
from pandas import Series, DataFrame
import numpy as np
import pandas as pd
data = DataFrame(np.arange(12.).reshape((3,4)), index = ['a','b','c'], columns = ['one','two','three','four'])
data

   one  two  three  four
a  0.0  1.0    2.0   3.0
b  4.0  5.0    6.0   7.0
c  8.0  9.0   10.0  11.0

In [23]:
data.to_csv('C:/Users/cleopathy/python_note/python_data_analysis/out.csv')

In [24]:
data.to_csv('C:/Users/cleopathy/python_note/python_data_analysis/out1.csv',index=False, header=False)

In [27]:
pd.read_csv('C:/Users/cleopathy/python_note/python_data_analysis/out.csv')

  Unnamed: 0  one  two  three  four
0          a  0.0  1.0    2.0   3.0
1          b  4.0  5.0    6.0   7.0
2          c  8.0  9.0   10.0  11.0

In [28]:
pd.read_csv('C:/Users/cleopathy/python_note/python_data_analysis/out1.csv')

   0.0  1.0   2.0   3.0
0  4.0  5.0   6.0   7.0
1  8.0  9.0  10.0  11.0

In [29]:
dates = pd.date_range('1/1/2000',periods =7)
ts = Series(np.arange(7),index=dates)
ts.to_csv('C:/Users/cleopathy/python_note/python_data_analysis/tseries.csv')

In [30]:
Series.from_csv('C:/Users/cleopathy/python_note/python_data_analysis/tseries.csv', parse_dates=True)

C:\Users\cleopathy\Anaconda3\lib\site-packages\pandas\core\series.py:3727: FutureWarning: from_csv is deprecated. Please use read_csv(...) instead. Note that some of the default arguments are different, so please refer to the documentation for from_csv when changing your function calls
  infer_datetime_format=infer_datetime_format)

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
dtype: int64

In [32]:
#web scraping
from lxml.html import parse
#this part learn later

In [33]:
#binary data formats
frame = pd.read_csv('C:/Users/cleopathy/python_note/python_data_analysis/ex1.csv')
frame

   a,   b,   c,   d, message
0  1,   2,   3,   4,   hello
1  5,   6,   7,   8,   world
2  9,  10,  11,  12,     foo

In [40]:
#reading excel files
xls_file = pd.ExcelFile('C:/Users/cleopathy/python_note/python_data_analysis/ex1.xls')
table = xls_file.parse('Sheet1')

In [41]:
table

   a,   b,   c,   d, message
0  1,   2,   3,   4,   hello
1  5,   6,   7,   8,   world
2  9,  10,  11,  12,     foo

In [42]:
#interact with HTML and WEB API
import requests
url = 'http://search.twitter.com/search.json?q=python20%pandas'
resp = requests.get(url)
resp

In [43]:
import json
data = json.loads(resp.text)
data.keys()

dict_keys(['errors'])

In [44]:
#interact with databse will learn later.

In [54]:
#data wrangling:clean, transform, merge, reshape data
df1 = DataFrame({'key':['b','b','a','c','a','a','b'],
                'data1':range(7)})
df2 = DataFrame({'key':['a','b','d'],
                'data2':range(3)})

df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [55]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [56]:
pd.merge(df1,df2) #based on df1, merge every row that df2 contain common key with df1

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [57]:
pd.merge(df1,df2,on = 'key') #same as above, specify the key in common and merge

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [58]:
df3 = DataFrame({'lkey':['b','b','a','c','a','a','b'],
                'data1':range(7)})
df4 = DataFrame({'rkey':['a','b','d'],
                'data2':range(3)})
pd.merge(df3,df4,left_on = 'lkey', right_on = 'rkey') #if column names are different, you specify the name by left and right on.

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [59]:
pd.merge(df1,df2,how = 'outer') #merge all df have, nan if missing

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [60]:
pd.merge(df1,df2,on = 'key', how = 'left') # everything based on key in df1 merge df2

  key  data1  data2
0   b      0    1.0
1   b      1    1.0
2   a      2    0.0
3   c      3    NaN
4   a      4    0.0
5   a      5    0.0
6   b      6    1.0

In [65]:
left = DataFrame({'key1':['foo','foo','bar'],
                 'key2':['one','two','one'],
                 'lval':[1,2,3]})
right = DataFrame({'key1':['foo','foo','bar','bar'],
                 'key2':['one','one','one','two'],
                 'rval':[4,5,6,7]})
pd.merge(left, right, on =['key1','key2'], how = 'outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [66]:
pd.merge(left,right,on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [ ]:
#merging on index

In [67]:
left1 = DataFrame({'key':['a','b','a','a','b','c'],
                  'value':range(6)})
right1 = DataFrame({'group_val':[3.5,7]}, index = ['a','b'])
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [68]:
right1

   group_val
a        3.5
b        7.0

In [69]:
pd.merge(left1,right1,left_on='key', right_index = True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [70]:
pd.merge(left1,right1,left_on='key', right_index = True, how = 'outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [71]:
lefth = DataFrame({'key1':['Ohio','Ohio','Ohio','Nevada','Nevada'],
                  'key2':[2000, 2001, 2002, 2001, 2001],
                  'data':np.arange(5.)})
righth = DataFrame(np.arange(12).reshape((6,2)),
                   index = [['Nevada','Nevada','Ohio','Ohio','Ohio','Ohio'],
                           [2001,2000,2000,2000,2001,2002]],
                   columns = ['event1','event2'])
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2001   4.0

In [72]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [73]:
pd.merge(lefth,righth,left_on =['key1','key2'], right_index = True) #index keep as merge key

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1
4  Nevada  2001   4.0       0       1

In [74]:
pd.merge(lefth,righth,left_on =['key1','key2'], right_index = True, how = 'outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1
4  Nevada  2001   4.0       0       1
4  Nevada  2000   NaN       2       3

In [77]:
#use the indexes of both sides of the merge is also not an issue.
#left_index = True , right_index = True

In [82]:
left2= DataFrame([[1.,2.],[3.,4.],[5.,6.]], 
                 index = ['a','c','e'],
                columns = ['Ohio','Nevada'])
right2 = DataFrame([[7.,8.],[9.,10.],[11.,12.],[13.,14.]],
                  index = ['b','c','d','e'],
                  columns = ['Missouri','Alabama'])
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [83]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [84]:
pd.merge(left2,right2,how='outer',left_index=True, right_index = True)
#keep all the index of right and left

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [85]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [86]:
left1.join(right1,on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [87]:
another = DataFrame([[7.,8.],[9.,10.],[11.,12.],[16.,17.]],
                   index = ['a','c','e','f'],
                   columns = ['New York','Oregon'])
left2.join([right2,another])
#join the index that three dataframe have in common.

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [88]:
left2.join([right2,another], how = 'outer')

C:\Users\cleopathy\Anaconda3\lib\site-packages\pandas\core\frame.py:6369: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  verify_integrity=True)

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   NaN     NaN       7.0      8.0       NaN     NaN
c   3.0     4.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0

In [89]:
#concatenating along an axis
arr = np.arange(12).reshape((3,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [90]:
np.concatenate([arr,arr],axis=1)
#binding data horizontaly

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [92]:
s1 = Series([0,1], index = ['a','b'])
s2 = Series([2,3,4], index = ['c','d','e'])
s3 = Series([5,6], index = ['f','g'])
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [93]:
pd.concat([s1,s2,s3],axis=1)

C:\Users\cleopathy\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [95]:
s4 = pd.concat([s1*5,s3])
pd.concat([s1,s4],axis=1)
#no overlap so there is outer join

C:\Users\cleopathy\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [96]:
pd.concat([s1,s4],axis=1,join= 'inner') # inner means only keep the overlap index

   0  1
a  0  0
b  1  5

In [97]:
s4

a    0
b    5
f    5
g    6
dtype: int64

In [101]:
result = pd.concat([s1,s1,s3],keys = ['one','two','three'])
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [102]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [103]:
pd.concat([s1,s2,s3],axis=1,keys=['one','two','three'])

C:\Users\cleopathy\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [ ]:
#another example is that row index is note meaningful in concat .
#so just ignore_index = True

In [105]:
df1= DataFrame(np.arange(6).reshape(3,2),index = ['a','b','c'],
              columns = ['one','two'])
df2= DataFrame(5+np.arange(4).reshape(2,2),index = ['a','c'],
              columns = ['three','four'])
pd.concat([df1,df2],axis=1,keys=['level1','level2'])

C:\Users\cleopathy\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [106]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [107]:
df2

   three  four
a      5     6
c      7     8

In [108]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'],
         names = ['upper','lower'])

C:\Users\cleopathy\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [109]:
#example of row index is note meaningful:
df1= DataFrame(np.random.randn(3,4), columns = ['a','b','c','d'])
df2 = DataFrame(np.random.randn(2,3),columns = ['b','d','a'])

In [110]:
df1

          a         b         c         d
0 -0.944734  1.130903 -2.882463  0.109422
1 -1.336899  0.052776  0.658945 -2.010171
2 -0.417307 -1.121945  1.439433 -1.794131

In [111]:
df2

          b         d         a
0 -0.164175  0.663359 -0.012428
1  1.503221  0.008658  1.221383

In [112]:
pd.concat([df1,df2],ignore_index = True)
#combine all columns of df1 and df2

C:\Users\cleopathy\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          a         b         c         d
0 -0.944734  1.130903 -2.882463  0.109422
1 -1.336899  0.052776  0.658945 -2.010171
2 -0.417307 -1.121945  1.439433 -1.794131
3 -0.012428 -0.164175       NaN  0.663359
4  1.221383  1.503221       NaN  0.008658

In [122]:
#combine data with overlap
a = Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],
       
           index = ['f','e','d','c','b','a'])
b = Series(np.arange(len(a),dtype = np.float64),
           index = ['f','e','d','c','b','a'])

In [123]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [124]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [125]:
b[-1]

5.0

In [126]:
b[-1] = np.nan
np.where(pd.isnull(a),b,a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [127]:
b[:-2].combine_first(a[2:])
#perform same operation as above, and data alignment

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [128]:
df1 = DataFrame({'a':[1.,np.nan,5.,np.nan],
                'b':[np.nan,2.,np.nan, 6.],
                'c':range(2,18,4)})

In [129]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [130]:
df2 = DataFrame({'a':[5.,4.,np.nan,3.,7.],
                'b':[np.nan,3.,4., 6.,8.]})
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [132]:
df1.combine_first(df2)
#this method combine df1 and df2 based on df1, if df1 value is missing ,then use df2 value.
#all the value are combined.

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [134]:
#reshaping and pivoting
#hierarchical indexing
data = DataFrame(np.arange(6).reshape((2,3)),
                index = pd.Index(['Ohio','Colorado'],
                                name= 'state'),
                columns = pd.Index(['one','two','three'],
                                  name = 'numer'))
data

numer     one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [135]:
result = data.stack()

In [136]:
result

state     numer
Ohio      one      0
          two      1
          three    2
Colorado  one      3
          two      4
          three    5
dtype: int32

In [137]:
result.unstack()

numer     one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [138]:
result.unstack(0)

state  Ohio  Colorado
numer
one       0         3
two       1         4
three     2         5

In [139]:
result.unstack('state') #unstack by passing a level number or name:

state  Ohio  Colorado
numer
one       0         3
two       1         4
three     2         5

In [141]:
s1 = Series([0,1,2,3], index = ['a','b','c','d'])
s2 = Series([4,5,6], index = ['c','d','e'])
s1

a    0
b    1
c    2
d    3
dtype: int64

In [142]:
s2

c    4
d    5
e    6
dtype: int64

In [143]:
data2= pd.concat([s1,s2], keys = ['one','two'])
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [144]:
data2.unstack().stack() #concat by just combine vertical in original version.

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [145]:
df = DataFrame({'left':result, 'right': result + 5},
              columns = pd.Index(['left','right'],
                                name = 'side'))
df

side            left  right
state    numer
Ohio     one       0      5
         two       1      6
         three     2      7
Colorado one       3      8
         two       4      9
         three     5     10

In [146]:
df.unstack('state')

side  left          right
state Ohio Colorado  Ohio Colorado
numer
one      0        3     5        8
two      1        4     6        9
three    2        5     7       10

In [148]:
#a common way to store multiple time series in databases adn csv is long or stacked 
#format:
#pivoting long to wide format
ldata = pd.read_csv('C:/Users/cleopathy/python_note/python_data_analysis/ldata.csv')
ldata[:10]

   Unnamed: 0             date     item     value
0           0   3/31/1959 0:00  realgdp  2710.349
1           1   3/31/1959 0:00     infl     0.000
2           2   3/31/1959 0:00    unemp     5.800
3           3   6/30/1959 0:00  realgdp  2778.801
4           4   6/30/1959 0:00     infl     2.340
5           5   6/30/1959 0:00    unemp     5.100
6           6   9/30/1959 0:00  realgdp  2775.488
7           7   9/30/1959 0:00     infl     2.740
8           8   9/30/1959 0:00    unemp     5.300
9           9  12/31/1959 0:00  realgdp  2785.201

In [151]:
pivoted = ldata.pivot('date','item','value')
pivoted.head() # data transformation

item             infl   realgdp  unemp
date
12/31/1959 0:00   NaN  2785.201    NaN
3/31/1959 0:00   0.00  2710.349    5.8
6/30/1959 0:00   2.34  2778.801    5.1
9/30/1959 0:00   2.74  2775.488    5.3

In [153]:
ldata['value2'] = np.random.randn(len(ldata))
ldata[:10]

   Unnamed: 0             date     item     value    value2
0           0   3/31/1959 0:00  realgdp  2710.349 -0.041648
1           1   3/31/1959 0:00     infl     0.000  0.102474
2           2   3/31/1959 0:00    unemp     5.800 -0.385552
3           3   6/30/1959 0:00  realgdp  2778.801 -0.000671
4           4   6/30/1959 0:00     infl     2.340 -1.252139
5           5   6/30/1959 0:00    unemp     5.100 -1.780223
6           6   9/30/1959 0:00  realgdp  2775.488  1.477542
7           7   9/30/1959 0:00     infl     2.740  0.239942
8           8   9/30/1959 0:00    unemp     5.300  0.491107
9           9  12/31/1959 0:00  realgdp  2785.201  0.173145

In [154]:
pivoted = ldata.pivot('date','item')
pivoted[:5]

                Unnamed: 0               value                    value2  \
item                  infl realgdp unemp  infl   realgdp unemp      infl
date
12/31/1959 0:00        NaN     9.0   NaN   NaN  2785.201   NaN       NaN
3/31/1959 0:00         1.0     0.0   2.0  0.00  2710.349   5.8  0.102474
6/30/1959 0:00         4.0     3.0   5.0  2.34  2778.801   5.1 -1.252139
9/30/1959 0:00         7.0     6.0   8.0  2.74  2775.488   5.3  0.239942


item              realgdp     unemp
date
12/31/1959 0:00  0.173145       NaN
3/31/1959 0:00  -0.041648 -0.385552
6/30/1959 0:00  -0.000671 -1.780223
9/30/1959 0:00   1.477542  0.491107

In [155]:
pivoted['value'][:5]

item             infl   realgdp  unemp
date
12/31/1959 0:00   NaN  2785.201    NaN
3/31/1959 0:00   0.00  2710.349    5.8
6/30/1959 0:00   2.34  2778.801    5.1
9/30/1959 0:00   2.74  2775.488    5.3

In [156]:
#pivot is just a shortcut for creating a hierarchical index using set_index
#and reshaping with unstack
unstacked = ldata.set_index(['date','item']).unstack('item')
unstacked[:7]

                Unnamed: 0               value                    value2  \
item                  infl realgdp unemp  infl   realgdp unemp      infl
date
12/31/1959 0:00        NaN     9.0   NaN   NaN  2785.201   NaN       NaN
3/31/1959 0:00         1.0     0.0   2.0  0.00  2710.349   5.8  0.102474
6/30/1959 0:00         4.0     3.0   5.0  2.34  2778.801   5.1 -1.252139
9/30/1959 0:00         7.0     6.0   8.0  2.74  2775.488   5.3  0.239942


item              realgdp     unemp
date
12/31/1959 0:00  0.173145       NaN
3/31/1959 0:00  -0.041648 -0.385552
6/30/1959 0:00  -0.000671 -1.780223
9/30/1959 0:00   1.477542  0.491107

In [157]:
#data transformation
data = DataFrame({'k1':['one']*3 +['two']*4,
                 'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [159]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [160]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [161]:
data.drop_duplicates(['k1']) #drop duplicated in k1 column

    k1  k2
0  one   1
3  two   3

In [163]:
data.drop_duplicates(['k1','k2'], take_last = True)

TypeError: drop_duplicates() got an unexpected keyword argument 'take_last'

In [165]:
data = DataFrame({'food':['bacon','pulled pork','bacon','pastrami','corned beef','bacon',
                         'pastrami','honey ham','nova lox'],
                 'ounces': [4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [167]:
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [168]:
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)

In [169]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [170]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [171]:
#replacing values
data = Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [172]:
data.replace(-999,np.nan) #then we replaced all -999 to nan

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [173]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [174]:
data.replace([-999,-1000],[np.nan,0]
            )

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [175]:
#renaming axis indexes
data = DataFrame(np.arange(12.).reshape((3,4)),
                index = ['ohio','colorado','new york'],
                columns = ['one','two','three','four'])

In [178]:
data

          one  two  three  four
OHIO      0.0  1.0    2.0   3.0
COLORADO  4.0  5.0    6.0   7.0
NEW YORK  8.0  9.0   10.0  11.0

In [179]:
data.index= data.index.map(str.upper) #assign to index, modifying dataframe in place:
data

          one  two  three  four
OHIO      0.0  1.0    2.0   3.0
COLORADO  4.0  5.0    6.0   7.0
NEW YORK  8.0  9.0   10.0  11.0

In [180]:
data.rename(index = {'OHIO':'INDIANA'},
           columns = {'three':'peekaboo'})

          one  two  peekaboo  four
INDIANA   0.0  1.0       2.0   3.0
COLORADO  4.0  5.0       6.0   7.0
NEW YORK  8.0  9.0      10.0  11.0